src/Documents/ЗаполнитьКоленоМаршрута/ЗаполнитьКоленоМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаполнитьКоленоМаршрута</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКолена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрэкНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ЗаполнитьКоленоМаршрута/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ИзменитьСупергруппу();
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЗаполнитьКоленоМаршрута.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//СтоСПОбмен_Общий.ОтразитьСтоСПОбмен(ДополнительныеСвойства, Движения, Отказ);
	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН(ДополнительныеСвойства, Движения, Отказ);
	#КонецОбласти
	
	//ДвиженияСпОбмен(Отказ, РежимПроведения);
КонецПроцедуры

Процедура ИзменитьСупергруппу()
	обСупергруппа= Супергруппа.ПолучитьОбъект();
	колено=обСупергруппа.Маршрут[НомерКолена-1];
	ЗаполнитьЗначенияСвойств(Колено,Ссылка);
	НачатьТранзакцию();
	УдаляемСтарыеОбменыПоКолену(СуперГруппа,НомерКолена);
	Попытка
		обСупергруппа.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
	КонецПопытки;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура УдаляемСтарыеОбменыПоКолену(СуперГруппа,Колено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаполнитьКоленоМаршрута.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаполнитьКоленоМаршрута КАК ЗаполнитьКоленоМаршрута
		|ГДЕ
		|	ЗаполнитьКоленоМаршрута.Ссылка <> &Ссылка
		|	И ЗаполнитьКоленоМаршрута.Супергруппа = &Супергруппа
		|	И ЗаполнитьКоленоМаршрута.НомерКолена = &НомерКолена";
	
	Запрос.УстановитьПараметр("НомерКолена", Колено);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Супергруппа", Супергруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		об=Выборка.Ссылка.ПолучитьОбъект();
		об.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры



#Область Обмен100СП

//Процедура ДвиженияСпОбмен(Отказ, Режим)
//	Если не (Константы.ИспоьзоватьДетальныйОбмен.Получить() и Константы.ДатаХраненияДвиженийОбмена.Получить()<=Дата)
//		Тогда Возврат; КонецЕсли;
//	Движения.Обмен100сп.Записывать = Истина;	
//	Движения.Обмен100спСообщения.Записывать = Истина;
//	
//		Движение = Движения.Обмен100спСообщения.Добавить();
//		
//		Движение.Период = Дата;
//		Движение.типОбмена=Перечисления.ТипыОбменов100сп.СуперГруппаКолено;
//		Движение.Мегаордер = Супергруппа;
//		Движение.Партия = Ссылка;
//		
//		Движение.Сообщение = СтоСП.ПолучитьТег(ПолучитьСтруктуруДляОбмена(),"superGroupStage");
//		Движение.Покупка   = Супергруппа.Покупка;
//		Движение.Участник  = Супергруппа.Участник;
//		
//		//Движение = Движения.Обмен100сп.Добавить();
//		//Движение.Период 	= Дата;
//		//Движение.типОбмена	= Перечисления.ТипыОбменов100сп.СуперГруппаКолено;
//		//Движение.Мегаордер 	= Супергруппа;
//		//Движение.Партия 	= Ссылка;
//		//Движение.Статус 	= Перечисления.СтатусОтпавкиНаСайт.Сформирован;

//КонецПроцедуры

//Функция ПолучитьСтруктуруДляОбмена()
//	результат=Новый Структура;
//	результат.Вставить("documentNumber",		Супергруппа.Код);
//	результат.Вставить("ordinalNumber",			НомерКолена); 
//	результат.Вставить("estimateDeliveryDate",	?(ЗначениеЗаполнено(ДатаДоставкиПлан),ДатаДоставкиПлан,""));
//	результат.Вставить("actualDeliveryDate",	?(ЗначениеЗаполнено(ДатаДоставкиФакт),ДатаДоставкиФакт,""));
//	результат.Вставить("deliveryDescription",   Комментарий);
//	Возврат результат;
//КонецФункции	

#КонецОбласти
